eringerli/esp32-aog/src/main.cpp
  // Sensors Tab
  {
    uint16_t tab = ESPUI.addControl( ControlType::Tab, "Sensors", "Sensors" );

    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "I2C SDA Gpio*", String( ( int )steerConfig.gpioSDA ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.gpioSDA = ( SteerConfig::Gpio )control->value.toInt();
        setResetButtonToRed();
      } );
      ESPUI.addControl( ControlType::Option, "Board Default", "-1", ControlColor::Alizarin, sel );
      addGpioOutput( sel );
    }
    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "I2C SCL Gpio*", String( ( int )steerConfig.gpioSCL ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.gpioSCL = ( SteerConfig::Gpio )control->value.toInt();
        setResetButtonToRed();
      } );
      ESPUI.addControl( ControlType::Option, "Board Default", "-1", ControlColor::Alizarin, sel );
      addGpioOutput( sel );
    }
    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "I2C Bus Speed*", String( steerConfig.i2cBusSpeed ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.i2cBusSpeed = control->value.toInt();
      } );
      ESPUI.addControl( ControlType::Min, "Min", "10000", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", "5000000", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", "1000", ControlColor::Peterriver, num );
    }
    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "IMU*", String( ( int )steerConfig.imuType ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.imuType = ( SteerConfig::ImuType )control->value.toInt();
        setResetButtonToRed();
      } );
      ESPUI.addControl( ControlType::Option, "No IMU", "0", ControlColor::Alizarin, sel );
      ESPUI.addControl( ControlType::Option, "FXOS8700/FXAS21002", "2", ControlColor::Alizarin, sel );
    }

    {
      ESPUI.addControl( ControlType::Switcher, "Send Calibration Data from IMU to USB", steerImuInclinometerData.sendCalibrationDataFromImu ? "1" : "0", ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerImuInclinometerData.sendCalibrationDataFromImu = control->value.toInt() == 1;
      } );
    }

    if( steerConfig.mode == SteerConfig::Mode::AgOpenGps ) {
      {
        uint16_t sel = ESPUI.addControl( ControlType::Select, "Inclinometer*", String( ( int )steerConfig.inclinoType ), ControlColor::Wetasphalt, tab,
        []( Control * control, int id ) {
          steerConfig.inclinoType = ( SteerConfig::InclinoType )control->value.toInt();
          setResetButtonToRed();
        } );
        ESPUI.addControl( ControlType::Option, "No Inclinometer", "0", ControlColor::Alizarin, sel );
        ESPUI.addControl( ControlType::Option, "MMA8451", "1", ControlColor::Alizarin, sel );
        // ESPUI.addControl( ControlType::Option, "DOGS2", "2", ControlColor::Alizarin, sel );
        ESPUI.addControl( ControlType::Option, "FXOS8700/FXAS21002", "3", ControlColor::Alizarin, sel );
      }

      {
        ESPUI.addControl( ControlType::Switcher, "Invert Roll Axis (enable for older versions of AgOpenGPS)", steerConfig.invertRoll ? "1" : "0", ControlColor::Peterriver, tab,
        []( Control * control, int id ) {
          steerConfig.invertRoll = control->value.toInt() == 1;
        } );
      }
    }

    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "Mounting Correction (Roll) of Imu", String( steerConfig.mountCorrectionImuRoll ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.mountCorrectionImuRoll = control->value.toFloat();
        calculateMountingCorrection();
      } );
      ESPUI.addControl( ControlType::Min, "Min", "-180", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", "180", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", "0.05", ControlColor::Peterriver, num );
    }

    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "Mounting Correction (Pitch) of Imu", String( steerConfig.mountCorrectionImuPitch ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.mountCorrectionImuPitch = control->value.toFloat();
        calculateMountingCorrection();
      } );
      ESPUI.addControl( ControlType::Min, "Min", "-180", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", "180", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", "0.05", ControlColor::Peterriver, num );
    }

    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "Mounting Correction (Yaw) of Imu", String( steerConfig.mountCorrectionImuYaw ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.mountCorrectionImuYaw = control->value.toFloat();
        calculateMountingCorrection();
      } );
      ESPUI.addControl( ControlType::Min, "Min", "-180", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", "180", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", "0.05", ControlColor::Peterriver, num );
    }
  }

  // NTRIP/GPS Tab
  {
    uint16_t tab = ESPUI.addControl( ControlType::Tab, "NTRIP/GPS", "NTRIP/GPS" );

    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "RTK Correction*", String( ( int )steerConfig.rtkCorrectionType ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.rtkCorrectionType = ( SteerConfig::RtkCorrectionType )control->value.toInt();
        setResetButtonToRed();
      } );
      ESPUI.addControl( ControlType::Option, "No Correction", "0", ControlColor::Alizarin, sel );
      ESPUI.addControl( ControlType::Option, "NTRIP", "1", ControlColor::Alizarin, sel );
      // ESPUI.addControl( ControlType::Option, "UDP", "2", ControlColor::Alizarin, sel );
      // ESPUI.addControl( ControlType::Option, "TCP", "3", ControlColor::Alizarin, sel );
    }

    ESPUI.addControl( ControlType::Text, "Server*", String( steerConfig.rtkCorrectionServer ), ControlColor::Wetasphalt, tab,
    []( Control * control, int id ) {
      control->value.toCharArray( steerConfig.rtkCorrectionServer, sizeof( steerConfig.rtkCorrectionServer ) );
      setResetButtonToRed();
    } );
    ESPUI.addControl( ControlType::Text, "Username*", String( steerConfig.rtkCorrectionUsername ), ControlColor::Wetasphalt, tab,
    []( Control * control, int id ) {
      control->value.toCharArray( steerConfig.rtkCorrectionUsername, sizeof( steerConfig.rtkCorrectionUsername ) );
      setResetButtonToRed();
    } );
    ESPUI.addControl( ControlType::Text, "Password*", String( steerConfig.rtkCorrectionPassword ), ControlColor::Wetasphalt, tab,
    []( Control * control, int id ) {
      control->value.toCharArray( steerConfig.rtkCorrectionPassword, sizeof( steerConfig.rtkCorrectionPassword ) );
      setResetButtonToRed();
    } );
    ESPUI.addControl( ControlType::Text, "Mountpoint*", String( steerConfig.rtkCorrectionMountpoint ), ControlColor::Wetasphalt, tab,
    []( Control * control, int id ) {
      control->value.toCharArray( steerConfig.rtkCorrectionMountpoint, sizeof( steerConfig.rtkCorrectionMountpoint ) );
      setResetButtonToRed();
    } );
    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "Port*", String( steerConfig.rtkCorrectionPort ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.rtkCorrectionPort = control->value.toInt();
      } );
      ESPUI.addControl( ControlType::Min, "Min", "1", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
    }

    {
      uint16_t baudrate = ESPUI.addControl( ControlType::Select, "Baudrate GPS", String( steerConfig.rtkCorrectionBaudrate ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        uint32_t baudrate = control->value.toInt();
        steerConfig.rtkCorrectionBaudrate = baudrate;
        Serial2.updateBaudRate( baudrate );
      } );
      ESPUI.addControl( ControlType::Option, "4800", "4800", ControlColor::Alizarin, baudrate );
      ESPUI.addControl( ControlType::Option, "9600", "9600", ControlColor::Alizarin, baudrate );
      ESPUI.addControl( ControlType::Option, "19200", "19200", ControlColor::Alizarin, baudrate );
      ESPUI.addControl( ControlType::Option, "38400", "38400", ControlColor::Alizarin, baudrate );
      ESPUI.addControl( ControlType::Option, "57600", "57600", ControlColor::Alizarin, baudrate );
      ESPUI.addControl( ControlType::Option, "115200", "115200", ControlColor::Alizarin, baudrate );
      ESPUI.addControl( ControlType::Option, "230400", "230400", ControlColor::Alizarin, baudrate );
      ESPUI.addControl( ControlType::Option, "460800", "460800", ControlColor::Alizarin, baudrate );
      ESPUI.addControl( ControlType::Option, "921600", "921600", ControlColor::Alizarin, baudrate );
    }

    ESPUI.addControl( ControlType::Number, "Intervall to send Position", String( steerConfig.ntripPositionSendIntervall ), ControlColor::Peterriver, tab,
    []( Control * control, int id ) {
      steerConfig.ntripPositionSendIntervall = control->value.toInt();
    } );

    textNmeaToSend = ESPUI.addControl( ControlType::Text, "NMEA-String to send (leave empty to send live position)", String( steerConfig.rtkCorrectionNmeaToSend ), ControlColor::Peterriver, tab,
    []( Control * control, int id ) {
      control->value.toCharArray( steerConfig.rtkCorrectionNmeaToSend, sizeof( steerConfig.rtkCorrectionNmeaToSend ) );
    } );

    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "Send NMEA-data to", String( ( int )steerConfig.sendNmeaDataTo ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.sendNmeaDataTo = ( SteerConfig::SendNmeaDataTo )control->value.toInt();
      } );
      ESPUI.addControl( ControlType::Option, "Nowhere", "0", ControlColor::Alizarin, sel );
      ESPUI.addControl( ControlType::Option, "UDP", "1", ControlColor::Alizarin, sel );
      // ESPUI.addControl( ControlType::Option, "TCP", "2", ControlColor::Alizarin, sel );
      ESPUI.addControl( ControlType::Option, "Serial", "3", ControlColor::Alizarin, sel );
      ESPUI.addControl( ControlType::Option, "Serial1", "4", ControlColor::Alizarin, sel );
      ESPUI.addControl( ControlType::Option, "Serial2", "5", ControlColor::Alizarin, sel );
      // ESPUI.addControl( ControlType::Option, "Bluetooth", "6", ControlColor::Alizarin, sel );
    }

    ESPUI.addControl( ControlType::Number, "Port to send Data to*", String( steerConfig.sendNmeaDataUdpPort ), ControlColor::Wetasphalt, tab,
    []( Control * control, int id ) {
      steerConfig.sendNmeaDataUdpPort = control->value.toInt();
      setResetButtonToRed();
    } );
    ESPUI.addControl( ControlType::Number, "Port to send Data from*", String( steerConfig.sendNmeaDataUdpPortFrom ), ControlColor::Wetasphalt, tab,
    []( Control * control, int id ) {
      steerConfig.sendNmeaDataUdpPortFrom = control->value.toInt();
      setResetButtonToRed();
    } );

    {
      uint16_t num = ESPUI.addControl( ControlType::Number, "TCP-Socket for a direct connection to the GPS-Receiver (set to 0 to deactivate, can be used for configuration with u-center or with 3rd-party software)*", String( steerConfig.sendNmeaDataTcpPort ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.sendNmeaDataTcpPort = control->value.toInt();
      } );
      ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
      ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
    }
  }

  if( steerConfig.mode == SteerConfig::Mode::QtOpenGuidance ) {

    // Channels Tab
    {
      uint16_t tab = ESPUI.addControl( ControlType::Tab, "Channels", "Channels" );

      {
        uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID Autosteer Enable", String( steerConfig.qogChannelIdAutosteerEnable ), ControlColor::Peterriver, tab,
        []( Control * control, int id ) {
          steerConfig.qogChannelIdAutosteerEnable = control->value.toInt();
        } );
        ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
      }
      {
        uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID Workswitch", String( steerConfig.qogChannelIdWorkswitch ), ControlColor::Peterriver, tab,
        []( Control * control, int id ) {
          steerConfig.qogChannelIdWorkswitch = control->value.toInt();
        } );
        ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
      }
      {
        uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID Steerswitch", String( steerConfig.qogChannelIdSteerswitch ), ControlColor::Peterriver, tab,
        []( Control * control, int id ) {
          steerConfig.qogChannelIdWorkswitch = control->value.toInt();
        } );
        ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
      }

      {
        uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID Wheel Angle", String( steerConfig.qogChannelIdWheelAngle ), ControlColor::Peterriver, tab,
        []( Control * control, int id ) {
          steerConfig.qogChannelIdWheelAngle = control->value.toInt();
        } );
        ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
      }

      {
        uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID Steer Angle Setpoint", String( steerConfig.qogChannelIdSetpointSteerAngle ), ControlColor::Peterriver, tab,
        []( Control * control, int id ) {
          steerConfig.qogChannelIdSetpointSteerAngle = control->value.toInt();
        } );
        ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
      }

      {
        uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID Orientation", String( steerConfig.qogChannelIdOrientation ), ControlColor::Peterriver, tab,
        []( Control * control, int id ) {
          steerConfig.qogChannelIdOrientation = control->value.toInt();
        } );
        ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
      }

      {
        uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID GPS Data In", String( steerConfig.qogChannelIdGpsDataIn ), ControlColor::Peterriver, tab,
        []( Control * control, int id ) {
          steerConfig.qogChannelIdGpsDataIn = control->value.toInt();
        } );
        ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
      }
      {
        uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID GPS Data Out", String( steerConfig.qogChannelIdGpsDataOut ), ControlColor::Peterriver, tab,
        []( Control * control, int id ) {
          steerConfig.qogChannelIdGpsDataOut = control->value.toInt();
        } );
        ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
        ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
      }

      if( steerConfig.mode == SteerConfig::Mode::QtOpenGuidance && steerConfig.canBusEnabled ) {
        {
          uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID CAN: Rear Hitch", String( steerConfig.qogChannelIdCanRearHitch ), ControlColor::Peterriver, tab,
          []( Control * control, int id ) {
            steerConfig.qogChannelIdCanRearHitch = control->value.toInt();
          } );
          ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
        }
        {
          uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID CAN: Front Hitch", String( steerConfig.qogChannelIdCanFrontHitch ), ControlColor::Peterriver, tab,
          []( Control * control, int id ) {
            steerConfig.qogChannelIdCanFrontHitch = control->value.toInt();
          } );
          ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
        }
        {
          uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID CAN: Rear RPM", String( steerConfig.qogChannelIdCanRearPtoRpm ), ControlColor::Peterriver, tab,
          []( Control * control, int id ) {
            steerConfig.qogChannelIdCanRearPtoRpm = control->value.toInt();
          } );
          ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
        }
        {
          uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID CAN: Front RPM", String( steerConfig.qogChannelIdCanFrontPtoRpm ), ControlColor::Peterriver, tab,
          []( Control * control, int id ) {
            steerConfig.qogChannelIdCanFrontPtoRpm = control->value.toInt();
          } );
          ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
        }
        {
          uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID CAN: Motor RPM", String( steerConfig.qogChannelIdCanMotorRpm ), ControlColor::Peterriver, tab,
          []( Control * control, int id ) {
            steerConfig.qogChannelIdCanMotorRpm = control->value.toInt();
          } );
          ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
        }
        {
          uint16_t num = ESPUI.addControl( ControlType::Number, "Channel ID CAN: Wheel-based Speed", String( steerConfig.qogChannelIdCanWheelbasedSpeed ), ControlColor::Peterriver, tab,
          []( Control * control, int id ) {
            steerConfig.qogChannelIdCanWheelbasedSpeed = control->value.toInt();
          } );
          ESPUI.addControl( ControlType::Min, "Min", "0", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Max, "Max", "65535", ControlColor::Peterriver, num );
          ESPUI.addControl( ControlType::Step, "Step", "1", ControlColor::Peterriver, num );
        }
      }
    }
  }

  // Default Configurations Tab
  {
    uint16_t tab = ESPUI.addControl( ControlType::Tab, "Configurations", "Configurations" );
    ESPUI.addControl( ControlType::Label, "Attention:", "These Buttons here reset the whole config. This affects the WIFI too, if not configured otherwise below. You have to press \"Apply & Reboot\" above to actualy store them.", ControlColor::Carrot, tab );

